app/controllers/videos_controller.rb

	def create
		@videos = Video.new(video_params)
		if @videos.save
---
INSERT INTO "videos" ("publisher", "title", "url", "source", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def update
		@video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]

	def destroy
		@video = Video.find(params[:id])
		@video.destroy
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]